{
  "categories": {
    "fees": {
      "keywords": ["fee", "fees", "payment", "tuition", "cost", "money", "pay", "शुल्क", "फीस", "पैसा", "भुगतान", "ફી", "પૈસા", "ચુકવણી", "शुल्क", "पैसे", "भुगतान", "फीस", "पैसा", "भुगतान"],
      "responses": {
        "en": "Fee payment deadline is usually at the beginning of each semester. You can pay online through the college portal or visit the accounts office during 9 AM - 5 PM. For fee structure details, check the college website or contact the accounts department.",
        "hi": "शुल्क भुगतान की अंतिम तिथि आमतौर पर हर सेमेस्टर की शुरुआत में होती है। आप कॉलेज पोर्टल के माध्यम से ऑनलाइन भुगतान कर सकते हैं या सुबह 9 बजे से शाम 5 बजे तक खाता कार्यालय जा सकते हैं। शुल्क संरचना के विवरण के लिए, कॉलेज की वेबसाइट देखें या खाता विभाग से संपर्क करें।",
        "gu": "ફી ચુકવણીની અંતિમ તારીખ સામાન્ય રીતે દરેક સેમેસ્ટરની શરૂઆતમાં હોય છે. તમે કૉલેજ પોર્ટલ દ્વારા ઑનલાઇન ચુકવણી કરી શકો છો અથવા સવારે 9 થી સાંજે 5 વાગ્યા દરમિયાન એકાઉન્ટ્સ ઑફિસની મુલાકાત લઈ શકો છો. ફી સ્ટ્રક્ચરની વિગતો માટે, કૉલેજની વેબસાઇટ તપાસો અથવા એકાઉન્ટ્સ ડિપાર્ટમેન્ટનો સંપર્ક કરો.",
        "mr": "शुल्क भरणाची शेवटची तारीख सहसा प्रत्येक सेमेस्टरच्या सुरुवातीला असते. तुम्ही कॉलेज पोर्टलद्वारे ऑनलाइन पेमेंट करू शकता किंवा सकाळी 9 ते संध्याकाळी 5 दरम्यान खाते कार्यालयात जाऊ शकता. फी स्ट्रक्चरच्या तपशीलांसाठी, कॉलेजची वेबसाइट तपासा किंवा खाते विभागाशी संपर्क साधा.",
        "raj": "शुल्क भुगतान री अंतिम तारीख सामान्यतः हर सेमेस्टर री शुरुआत में होवै। थे कॉलेज पोर्टल रे जरिये ऑनलाइन भुगतान कर सको या सवेरे 9 सूं सांझ 5 तक खाता कार्यालय जा सको। शुल्क संरचना री विगत रे लिए, कॉलेज री वेबसाइट देखो या खाता विभाग सूं संपर्क करो।"
      }
    },
    "scholarships": {
      "keywords": ["scholarship", "scholarships", "financial aid", "grant", "funding", "stipend", "छात्रवृत्ति", "स्कॉलरशिप", "आर्थिक सहायता", "સ્કોલરશિપ", "આર્થિક મદદ", "शिष्यवृत्ती", "आर्थिक मदत", "छात्रवृत्ति", "आर्थिक मदद"],
      "responses": {
        "en": "Scholarship applications are available on the college website from June to August. We offer merit-based, need-based, and category-specific scholarships. Required documents include income certificate, caste certificate (if applicable), previous academic records, and bank details. Submit before the deadline for consideration.",
        "hi": "छात्रवृत्ति के लिए आवेदन जून से अगस्त तक कॉलेज की वेबसाइट पर उपलब्ध हैं। हम योग्यता-आधारित, आवश्यकता-आधारित और श्रेणी-विशिष्ट छात्रवृत्ति प्रदान करते हैं। आवश्यक दस्तावेजों में आय प्रमाण पत्र, जाति प्रमाण पत्र (यदि लागू हो), पिछले शैक्षणिक रिकॉर्ड और बैंक विवरण शामिल हैं। विचार के लिए अंतिम तिथि से पहले जमा करें।",
        "gu": "સ્કોલરશિપ માટે અરજીઓ જૂનથી ઓગસ્ટ સુધી કૉલેજની વેબસાઇટ પર ઉપલબ્ધ છે. અમે મેરિટ-આધારિત, જરૂરિયાત-આધારિત અને કેટેગરી-વિશિષ્ટ સ્કોલરશિપ ઓફર કરીએ છીએ. જરૂરી દસ્તાવેજોમાં આવકનું પ્રમાણપત્ર, જાતિનું પ્રમાણપત્ર (જો લાગુ હોય), અગાઉના શૈક્ષણિક રેકોર્ડ અને બેંક વિગતોનો સમાવેશ થાય છે. વિચારણા માટે અંતિમ તારીખ પહેલા સબમિટ કરો.",
        "mr": "शिष्यवृत्तीसाठी अर्ज जून ते ऑगस्ट पर्यंत कॉलेजच्या वेबसाइटवर उपलब्ध आहेत. आम्ही गुणवत्ता-आधारित, गरज-आधारित आणि श्रेणी-विशिष्ट शिष्यवृत्ती देतो. आवश्यक कागदपत्रांमध्ये उत्पन्न प्रमाणपत्र, जात प्रमाणपत्र (जर लागू असेल), मागील शैक्षणिक नोंदी आणि बँकेचे तपशील समाविष्ट आहेत. विचारार्थ अंतिम तारखेपूर्वी सादर करा.",
        "raj": "छात्रवृत्ति रे लिए आवेदन जून सूं अगस्त तक कॉलेज री वेबसाइट पर उपलब्ध हैं। हम योग्यता-आधारित, जरूरत-आधारित अर श्रेणी-विशेष छात्रवृत्ति देवां हैं। जरूरी दस्तावेजां में आय प्रमाण पत्र, जाति प्रमाण पत्र (जे लागू हो), पहले रे शैक्षणिक रिकॉर्ड अर बैंक री जानकारी सामिल हैं। विचार रे लिए अंतिम तारीख सूं पैली जमा करो।"
      }
    },
    "timetable": {
      "keywords": ["timetable", "schedule", "class", "timing", "time table", "lecture", "periods", "समय सारणी", "टाइम टेबल", "क्लास", "व्याख्यान", "સમયપત્રક", "ટાઇમ ટેબલ", "વર્ગ", "લેક્ચર", "वेळापत्रक", "वर्ग", "व्याख्यान", "समय सारिणी", "क्लास", "लेक्चर"],
      "responses": {
        "en": "Timetables are updated weekly and posted on the college notice board, website, and WhatsApp groups. Regular classes are from 9 AM to 4 PM. Check for any last-minute changes before attending classes. Department-wise timetables are available at respective department offices.",
        "hi": "समय सारणी साप्ताहिक रूप से अपडेट की जाती है और कॉलेज के नोटिस बोर्ड, वेबसाइट और व्हाट्सऐप समूहों पर पोस्ट की जाती है। नियमित कक्षाएं सुबह 9 बजे से शाम 4 बजे तक होती हैं। कक्षा में जाने से पहले किसी भी अंतिम समय के बदलाव की जांच करें। विभागवार समय सारणी संबंधित विभाग के कार्यालयों में उपलब्ध है।",
        "gu": "સમયપત્રક સાપ્તાહિક અપડેટ થાય છે અને કૉલેજના નોટિસ બોર્ડ, વેબસાઇટ અને વ્હાટ્સએપ ગ્રુપ્સ પર પોસ્ટ કરવામાં આવે છે. નિયમિત ક્લાસ સવારે 9 થી બપોરે 4 વાગ્યા સુધી છે. વર્ગમાં હાજરી આપતા પહેલા કોઈપણ છેલ્લી ઘડીના ફેરફારો માટે તપાસો. વિભાગવાર સમયપત્રક સંબંધિત વિભાગની ઑફિસોમાં ઉપલબ્ધ છે.",
        "mr": "वेळापत्रक साप्ताहिक अपडेट केले जाते आणि कॉलेजच्या नोटीस बोर्ड, वेबसाइट आणि व्हाट्सअप गटांवर पोस्ट केले जाते. नियमित वर्ग सकाळी 9 ते दुपारी 4 पर्यंत आहेत. वर्गात जाण्यापूर्वी शेवटच्या क्षणी झालेल्या बदलांची तपासणी करा. विभागनिहाय वेळापत्रक संबंधित विभागाच्या कार्यालयांमध्ये उपलब्ध आहे.",
        "raj": "समय सारणी हफ्तावार अपडेट होवै अर कॉलेज रे नोटिस बोर्ड, वेबसाइट अर व्हाट्सऐप ग्रुप में पोस्ट होवै। नियमित क्लास सवेरे 9 सूं दोपहर 4 बजे तक होवै। क्लास में जावण सूं पैली कोई भी अंतिम समय रे बदलाव री जांच करो। विभागवार समय सारणी संबंधित विभाग रे कार्यालयां में उपलब्ध हैं।"
      }
    },
    "admission": {
      "keywords": ["admission", "admissions", "apply", "entrance", "eligibility", "application", "form", "प्रवेश", "दाखिला", "आवेदन", "पात्रता", "પ્રવેશ", "અરજી", "પાત્રતા", "प्रवेश", "अर्ज", "पात्रता", "प्रवेश", "आवेदन", "योग्यता"],
      "responses": {
        "en": "Admission applications are open from June to August for the next academic year. Check eligibility criteria on the college website, fill the online application form, pay the application fee, and submit required documents. Merit lists are published in September. For queries, contact the admission office.",
        "hi": "अगले शैक्षणिक वर्ष के लिए प्रवेश आवेदन जून से अगस्त तक खुले रहते हैं। कॉलेज की वेबसाइट पर पात्रता मानदंड जांचें, ऑनलाइन आवेदन फॉर्म भरें, आवेदन शुल्क का भुगतान करें और आवश्यक दस्तावेज जमा करें। मेरिट सूची सितंबर में प्रकाशित होती है। प्रश्नों के लिए, प्रवेश कार्यालय से संपर्क करें।",
        "gu": "આગામી શૈક્ષણિક વર્ષ માટે પ્રવેશની અરજીઓ જૂનથી ઓગસ્ટ સુધી ખુલ્લી છે. કૉલેજની વેબસાઇટ પર પાત્રતાના માપદંડો તપાસો, ઓનલાઇન અરજી ફોર્મ ભરો, અરજીની ફી ચૂકવો અને જરૂરી દસ્તાવેજો સબમિટ કરો. મેરિટ લિસ્ટ સપ્ટેમ્બરમાં પ્રકાશિત થાય છે. પૂછપરછ માટે, પ્રવેશ કાર્યાલયનો સંપર્ક કરો.",
        "mr": "पुढील शैक्षणिक वर्षासाठी प्रवेश अर्ज जून ते ऑगस्ट पर्यंत उघडे आहेत. कॉलेजच्या वेबसाइटवर पात्रता निकष तपासा, ऑनलाइन अर्ज फॉर्म भरा, अर्ज शुल्क भरा आणि आवश्यक कागदपत्रे सादर करा. गुणवत्ता यादी सप्टेंबरमध्ये प्रकाशित केली जाते. प्रश्नांसाठी, प्रवेश कार्यालयाशी संपर्क साधा.",
        "raj": "अगले शैक्षणिक बरस रे लिए प्रवेश आवेदन जून सूं अगस्त तक खुले रहवै हैं। कॉलेज री वेबसाइट पर पात्रता मानदंड देखो, ऑनलाइन आवेदन फॉर्म भरो, आवेदन शुल्क रो भुगतान करो अर जरूरी दस्तावेज जमा करो। मेरिट लिस्ट सितंबर में छपै। सवालां रे लिए, प्रवेश कार्यालय सूं संपर्क करो।"
      }
    },
    "exams": {
      "keywords": ["exam", "exams", "test", "results", "marks", "grades", "marks card", "परीक्षा", "रिजल्ट", "अंक", "ग्रेड", "પરીક્ષા", "પરિણામ", "માર્ક્સ", "ગ્રેડ", "परीक्षा", "निकाल", "गुण", "परीक्षा", "परिणाम", "अंक"],
      "responses": {
        "en": "Exam schedules are published 2 weeks before exams on the college website and notice boards. Internal assessments happen monthly. Final semester exams are in May and December. Results are declared within 30-45 days. Mark sheets and transcripts are available at the examination office.",
        "hi": "परीक्षा कार्यक्रम परीक्षा से 2 सप्ताह पहले कॉलेज की वेबसाइट और नोटिस बोर्ड पर प्रकाशित होते हैं। आंतरिक मूल्यांकन मासिक होता है। अंतिम सेमेस्टर परीक्षा मई और दिसंबर में होती है। परिणाम 30-45 दिनों के भीतर घोषित किए जाते हैं। अंक पत्रक और प्रतिलेख परीक्षा कार्यालय में उपलब्ध हैं।",
        "gu": "પરીક્ષાનું શેડ્યૂલ પરીક્ષાના 2 અઠવાડિયા પહેલા કૉલેજની વેબસાઇટ અને નોટિસ બોર્ડ પર પ્રકાશિત કરવામાં આવે છે. આંતરિક મૂલ્યાંકન માસિક થાય છે. અંતિમ સેમેસ્ટર પરીક્ષાઓ મે અને ડિસેમ્બરમાં હોય છે. પરિણામો 30-45 દિવસની અંદર જાહેર કરવામાં આવે છે. માર્કશીટ અને ટ્રાન્સક્રિપ્ટ પરીક્ષા કાર્યાલયમાં ઉપલબ્ધ છે.",
        "mr": "परीक्षेचे वेळापत्रक परीक्षेच्या 2 आठवड्यांपूर्वी कॉलेजच्या वेबसाइट आणि नोटीस बोर्डावर प्रकाशित केले जाते. अंतर्गत मूल्यमापन मासिक होते. अंतिम सत्र परीक्षा मे आणि डिसेंबरमध्ये होतात. निकाल 30-45 दिवसांच्या आत जाहीर केले जातात. मार्कशीट आणि ट्रान्स्क्रिप्ट परीक्षा कार्यालयात उपलब्ध आहेत.",
        "raj": "परीक्षा कार्यक्रम परीक्षा सूं 2 हफ्ता पैली कॉलेज री वेबसाइट अर नोटिस बोर्ड पर छपावै। आंतरिक मूल्यांकन मासिक होवै। अंतिम सेमेस्टर परीक्षा मई अर दिसंबर में होवै। परिणाम 30-45 दिन रे अंदर घोषित करावै। अंक पत्रक अर प्रतिलेख परीक्षा कार्यालय में उपलब्ध हैं।"
      }
    },
    "library": {
      "keywords": ["library", "books", "issue", "return", "library card", "study", "reading room", "पुस्तकालय", "किताब", "अध्ययन", "લાયબ્રેરી", "પુસ્તક", "અભ્યાસ", "ग्रंथालय", "पुस्तक", "अभ्यास", "पुस्तकालय", "पुस्तक", "अध्ययन"],
      "responses": {
        "en": "Library is open from 8 AM to 8 PM on weekdays and 9 AM to 5 PM on weekends. Students can issue up to 5 books for 15 days. Late return fine is ₹2 per day. Digital resources and WiFi are available. Reading room seats can be reserved online.",
        "hi": "पुस्तकालय सप्ताह के दिनों में सुबह 8 बजे से रात 8 बजे तक और सप्ताहांत में सुबह 9 बजे से शाम 5 बजे तक खुला रहता है। छात्र 15 दिनों के लिए 5 पुस्तकें निकाल सकते हैं। देर से वापसी का जुर्माना प्रति दिन ₹2 है। डिजिटल संसाधन और वाईफाई उपलब्ध है। पठन कक्ष की सीटें ऑनलाइन आरक्षित की जा सकती हैं।",
        "gu": "લાયબ્રેરી અઠવાડિયાના દિવસોમાં સવારે 8 થી રાત્રે 8 અને વીકએન્ડમાં સવારે 9 થી સાંજે 5 વાગ્યા સુધી ખુલ્લી છે. વિદ્યાર્થીઓ 15 દિવસ માટે 5 પુસ્તકો આપી શકે છે. મોડેથી પરત કરવાનો દંડ દરરોજ ₹2 છે. ડિજિટલ સંસાધનો અને વાઇફાઇ ઉપલબ્ધ છે. રીડિંગ રૂમની બેઠકો ઓનલાઇન બુક કરી શકાય છે.",
        "mr": "ग्रंथालय आठवड्याच्या दिवसांत सकाळी 8 ते रात्री 8 आणि आठवड्याच्या शेवटी सकाळी 9 ते संध्याकाळी 5 पर्यंत उघडे असते. विद्यार्थी 15 दिवसांसाठी 5 पुस्तके काढू शकतात. उशिरा परत केल्याचा दंड दररोज ₹2 आहे. डिजिटल संसाधने आणि वायफाय उपलब्ध आहे. वाचन कक्षाची जागा ऑनलाइन राखीव ठेवली जाऊ शकते.",
        "raj": "पुस्तकालय हफ्ते रे दिनां में सवेरे 8 सूं रात 8 बजे तक अर छुट्टी रे दिन सवेरे 9 सूं सांझ 5 बजे तक खुलो रहवै। छात्र 15 दिन रे लिए 5 किताबां काढ सकै। देर सूं वापस करण रो जुर्माना हर दिन ₹2 हैं। डिजिटल संसाधन अर वाईफाई उपलब्ध हैं। पठन कक्ष री सीटां ऑनलाइन बुक कर सकै।"
      }
    },
    "hostel": {
      "keywords": ["hostel", "accommodation", "rooms", "mess", "warden", "छात्रावास", "कमरा", "भोजन", "હોસ્ટેલ", "રૂમ", "ખોરાક", "वसतिगृह", "खोली", "जेवण", "छात्रावास", "कमरा", "भोजन"],
      "responses": {
        "en": "Hostel accommodation is available for outstation students. Application forms are available during admission. Fees include room rent, electricity, and mess charges. Hostel timings: 6 AM to 10 PM. Contact the warden for room allotment and hostel rules.",
        "hi": "बाहरी छात्रों के लिए छात्रावास की सुविधा उपलब्ध है। प्रवेश के दौरान आवेदन फॉर्म उपलब्ध हैं। शुल्क में कमरे का किराया, बिजली और मेस शुल्क शामिल है। छात्रावास समय: सुबह 6 बजे से रात 10 बजे तक। कमरे के आवंटन और छात्रावास नियमों के लिए वार्डन से संपर्क करें।",
        "gu": "બહારના વિદ્યાર્થીઓ માટે હોસ્ટેલ સુવિધા ઉપલબ્ધ છે. પ્રવેશ દરમિયાન અરજી ફોર્મ ઉપલબ્ધ છે. ફીમાં રૂમ ભાડું, વીજળી અને મેસ ચાર્જનો સમાવેશ થાય છે. હોસ્ટેલ ટાઇમિંગ: સવારે 6 થી રાત્રે 10 વાગ્યા સુધી. રૂમ એલોટમેન્ટ અને હોસ્ટેલ નિયમો માટે વોર્ડનનો સંપર્ક કરો.",
        "mr": "बाहेरील विद्यार्थ्यांसाठी वसतिगृह सुविधा उपलब्ध आहे. प्रवेशाच्या वेळी अर्ज फॉर्म उपलब्ध आहेत. फीमध्ये खोलीचे भाडे, वीज आणि जेवणाचे शुल्क समाविष्ट आहे. वसतिगृह वेळा: सकाळी 6 ते रात्री 10 पर्यंत. खोलीचे वाटप आणि वसतिगृह नियमांसाठी वॉर्डनशी संपर्क साधा.",
        "raj": "बाहरी छात्रां रे लिए छात्रावास री सुविधा उपलब्ध हैं। प्रवेश रे दौरान आवेदन फॉर्म मिलै। शुल्क में कमरे रो किराया, बिजली अर मेस शुल्क सामिल हैं। छात्रावास समय: सवेरे 6 सूं रात 10 बजे तक। कमरे रे आवंटन अर छात्रावास नियमां रे लिए वार्डन सूं संपर्क करो।"
      }
    }
  },
  "greetings": {
    "keywords": ["hello", "hi", "hey", "namaste", "good morning", "good afternoon", "good evening", "नमस्ते", "हैलो", "नमस्कार", "સુપ્રભાત", "નમસ્તે", "હેલો", "नमस्कार", "सुप्रभात", "हॅलो", "नमस्ते", "हैलो", "सुप्रभात"],
    "responses": {
      "en": "Hello! Welcome to our campus assistant. I can help you with information about fees, scholarships, timetables, admissions, exams, library, hostel, and other campus facilities. What would you like to know?",
      "hi": "नमस्ते! हमारे कैंपस सहायक में आपका स्वागत है। मैं शुल्क, छात्रवृत्ति, समय सारणी, प्रवेश, परीक्षा, पुस्तकालय, छात्रावास और अन्य कैंपस सुविधाओं के बारे में जानकारी दे सकता हूं। आप क्या जानना चाहते हैं?",
      "gu": "નમસ્તે! અમારા કેમ્પસ સહાયકમાં તમારું સ્વાગત છે. હું ફી, સ્કોલરશિપ, સમયપત્રક, પ્રવેશ, પરીક્ષાઓ, લાયબ્રેરી, હોસ્ટેલ અને અન્ય કેમ્પસ સુવિધાઓ વિશે માહિતી આપી શકું છું. તમે શું જાણવા માગો છો?",
      "mr": "नमस्कार! आमच्या कॅम्पस सहाय्यकामध्ये तुमचे स्वागत आहे. मी फी, शिष्यवृत्ती, वेळापत्रक, प्रवेश, परीक्षा, ग्रंथालय, वसतिगृह आणि इतर कॅम्पस सुविधांबद्दल माहिती देऊ शकतो. तुम्हाला काय जाणून घ्यायचे आहे?",
      "raj": "नमस्ते! हमारे कैंपस सहायक में थारो स्वागत हैं। मैं शुल्क, छात्रवृत्ति, समय सारणी, प्रवेश, परीक्षा, पुस्तकालय, छात्रावास अर दूसरी कैंपस सुविधाओं रे बारे में जानकारी दे सकूं। थे के जाणना चाओ?"
    }
  },
  "thanks": {
    "keywords": ["thanks", "thank you", "धन्यवाद", "शुक्रिया", "આભાર", "ધન્યવાદ", "धन्यवाद", "शुक्रिया", "धन्यवाद", "शुक्रिया"],
    "responses": {
      "en": "You're welcome! If you have any other questions about campus facilities or services, feel free to ask. Have a great day!",
      "hi": "आपका स्वागत है! यदि आपके पास कैंपस सुविधाओं या सेवाओं के बारे में कोई अन्य प्रश्न हैं, तो बेझिझक पूछें। आपका दिन शुभ हो!",
      "gu": "તમારું સ્વાગત છે! જો તમારી પાસે કેમ્પસ સુવિધાઓ અથવા સેવાઓ વિશે કોઈ અન્ય પ્રશ્નો હોય, તો પૂછવામાં અચકાશો નહીં. તમારો દિવસ શુભ હો!",
      "mr": "तुमचे स्वागत आहे! जर तुमच्याकडे कॅम्पस सुविधा किंवा सेवांबद्दल इतर प्रश्न असतील तर विचारण्यास मोकळा वाटा. तुमचा दिवस चांगला जाओ!",
      "raj": "थारो स्वागत हैं! जे थारे पास कैंपस सुविधाओं या सेवाओं रे बारे में कोई दूसरो सवाल हो, तो बेझिझक पूछो। थारो दिन शुभ हो!"
      }
  },
  "contact": {
    "office_hours": "9:00 AM - 5:00 PM, Monday to Friday",
    "phone": "+91-141-XXX-XXXX",
    "email": "info@college.edu",
    "address": "Technical Education Campus, Jaipur, Rajasthan",
    "emergency": "+91-141-XXX-XXXX (24/7)"
  },
  "fallback_phrases": {
    "en": ["I'm not sure about that", "Let me connect you with human assistance", "I don't have that information"],
    "hi": ["मुझे इसके बारे में यकीन नहीं है", "मैं आपको मानव सहायता से जोड़ता हूं", "मेरे पास यह जानकारी नहीं है"],
    "gu": ["મને તેના વિશે ખાતરી નથી", "હું તમને માનવ સહાયતા સાથે જોડું છું", "મારી પાસે તે માહિતી નથી"],
    "mr": ["मला त्याबद्दल खात्री नाही", "मी तुम्हाला मानवी मदतीशी जोडतो", "माझ्याकडे ती माहिती नाही"],
    "raj": ["मने इसके बारे में पक्का नहीं है", "मैं थने मानव सहायता सूं जोड़ूं", "मेरे पास यो जानकारी कोनी"]
  }
}

